Repository: nakqeeb/multi_store_flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# account_created
source: Account is created successfully.
ar: تم إنشاء الحساب بنجاح.

source: Account Info
ar: معلومات الحساب

source: Account Settings
ar: إعدادت الحساب

source: Add address
ar: إضافة عنوان

source: Add quantity
ar: أضف الكمية

source: Add Review
ar: إضافة التقييم

source: ADD TO CART
ar: أضف إلى السلة

source: Address
ar: العنوان

source: Address Book
ar: دليل العناوين

# address_has_deleted
source: Address has been deleted successfully
ar: تم حذف العنوان بنجاح

# address_house_building
source: Address, House No, Building Name
ar: العنوان ، رقم المنزل ، اسم المبنى

# address_required
source: address is required
ar: العنوان مطلوب

source: All stores
ar: جميع المتاجر

source: Already Have Account?
ar: لديك حساب بالفعل؟

# app_name
source: Mono Store
ar: متجر مونو

# are_you_sure_delete_product
source: Are you sure you want to delete this product?
ar: هل أنت متأكد أنك تريد حذف هذا المنتج؟

# are_you_sure_logout
source: Do you really want to sign out?
ar: هل تريد فعلاً تسجيل الخروج؟

# are_you_sure_to_clear_cart
source: Are you sure to clear the cart?
ar: هل أنت متأكد من مسح العربة؟

source: Balance
ar: الرصيد

source: Buy
ar: اشتري

source: Cancel
ar: إلغاء

source: Cart
ar: السلة

# cart_empty
source: Your Cart is Empty!
ar: عربة التسوق فارغة!

source: Cash On Delivery
ar: الدفع عند الاستلام

source: cash on delivery
ar: الدفع عند الاستلام

source: Category
ar: الفئة

# category_no_item
source: This category has no items yet!
ar: هذه الفئة لا تحتوي على عناصر حتى الآن!

source: Change
ar: تغيير

# change_delivery_status
source: Change Delivery Status To
ar: تغيير حالة التسليم إلى

source: Change language
ar: تغير اللغة

source: Change Password
ar: تغير كلمة المرور

# check_your_connection
source: Please check your connection and try again!
ar: يرجى التحقق من اتصالك وحاول مرة أخرى!

source: Checkout
ar: الدفع

source: City
ar: المدينة

# city_required
source: city is required
ar: اسم المدينة مطلوب

source: Clear Cart
ar: مسح السلة

source: Collect my money
ar: جمع رصيدي

source: Confirm
ar: تأكيد

source: Continue Shopping
ar: مواصلة التسوق

source: Cover Image
ar: صورة الغلاف

source: Dark mode
ar: الوضع الليلي

source: Dashboard
ar: لوحة الادارة

source: Delete
ar: حذف

source: Delete address
ar: حذف العنوان

source: Deleteing...
ar: جار الحذف...

source: delivered
ar: تم التوصيل

source: Delivery status
ar: حالة التسليم

source: Discount
ar: التخفيض

# do_you_delete_address
source: Do you really want to delete this address?
ar: هل تريد حقًا حذف هذا العنوان؟

source: Edit
ar: تعديل

# edit_ddress
source: Edit Address
ar: تعديل العنوان

source: Edit Product
ar: تعديل المنتج

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Store
ar: تعديل المتجر

source: Email
ar: البريد الإلكتروني

source: Email Address
ar: البريد الإلكتروني

# email_is_required
source: Email address is required
ar: البريد الالكتروني مطلوب

source: Enter address
ar: ادخل العنوان

# enter_city
source: Enter city name
ar: ادخل اسم المدينة

# enter_email
source: Enter your email
ar: ادخل بريدك الإلكتروني

# enter_full_name
source: Enter your full name
ar: ادخل اسمك الكامل

source: Enter landmark
ar: ادخل المَعلم

source: Enter new password
ar: ادخل كلمة المرور الجديدة

source: Enter old password
ar: ادخل كلمة المرور القديمة

# enter_password
source: Enter your password
ar: ادخل كلمة المرور

# enter_phone
source: Enter your phone
ar: ادخل رقم هاتفك

# enter_phone_whatsApp
source: Enter your Phone/WhatsApp number
ar: ادخل رقم هاتفك / واتساب

source: Enter pincode
ar: ادخل الرمز البريدي

source: Enter product description
ar: ادخل وصف المنتج

source: Enter product name
ar: أدخل اسم المنتج

# enter_province
source: Enter province name
ar: ادخل اسم المحافظة

# enter_store_name
source: Enter your store name
ar: ادخل اسم متجرك

source: Enter your review
ar: اعطنا رأيك

source: Estimated Delivery Date
ar: تاريخ الوصول المتوقع

# fill_all_fields
source: Please fill all required fields
ar: الرجاء إملاء كل الحقول المطلوبة

source: Follow
ar: تابع

source: Following
ar: متابع

source: Following stores
ar: المتاجر المتابعة

source: Forgot Password?
ar: نسيت كلمه المرور؟

source: Full Name
ar: الاسم الكامل

# fullname_required
source: full name is required
ar: الإسم الكامل مطلوب

source: Guest
ar: زائر

# haveNoAccountYet
source: Don't have Account yet?
ar: ليس لديك حساب؟

# hello
source: Hello {username}
ar: {username} مرحبا

source: Hello World!
ar: !مرحبا بالعالم

source: Home
ar: الرئيسية

source: Invalid discount
ar: الخصم غير صالح

source: Invalid email
ar: بريد إلكتروني خاطئ

source: Invalid price
ar: سعر غير صالح

source: Item count
ar: عدد الكمية

source: Item Description
ar: وصف المنتج

source: ITEM IN CART
ar: المنتج في السلة

source: Landmark
ar: المَعلم

# landmark_required
source: landmark is required
ar: المَعلم مطلوب

# landmark_road_area
source: Landmark, Road Name, Area
ar: المَعلم ، اسم الطريق ، المنطقة

# lang
source: Language
ar: اللغة

# language
source: English
ar: العربية

source: Light mode
ar: الوضع النهاري

source: Login
ar: تسجيل دخول

# login_first
source: You need to login first
ar: ًتحتاج لتسجيل الدخول اولا

source: Login now
ar: سجل دخولك الآن

# login_to_see_cart
source: Login first to see your cart.
ar: سجل دخولك اولاً لترى عربة التسوق الخاصة بك.

source: Logout
ar: تسجيل خروج

source: My Statistics
ar: إحصائياتي

source: My store
ar: متجري

source: Name
ar: الاسم

# name_no_empty
source: Please enter your name
ar: الرجاء ادخال اسمك

source: New order
ar: طلبية جديدة

source: New Password
ar: كلمة المرور الجديدة

# noInternet
source: No Internet Connection!
ar: لا يوجد اتصال بالانترنت!

# no_address_yet
source: You have not added any address yet!
ar: لم تقم بإضافة أي عنوان حتى الآن!

source: No addresses loaded!
ar: لم يتم تحميل عناوين!

# no_balance
source: You have no balance yet!
ar: ليس لديك رصيد بعد!

# no_order_yet
source: You haven't order anything yet!
ar: لم تطلب أي شيء بعد!

# no_orders_delivered
source: No orders are delivered yet!
ar: لم يتم تسليم أي طلبات حتى الآن!

source: No Orders loaded!
ar: لم يتم تحميل أي طلبات!

# no_orders_prepared
source: No orders are prepared yet!
ar: لم يتم تحضير أي طلبات حتى الآن!

# no_orders_shipped
source: No orders are shipped yet!
ar: لم يتم شحن أي طلبات حتى الآن!

# no_picked_images_yet
source: You have not picked any images yet!
ar: لم تقم باختيار الصور بعد!

source: No products loaded!
ar: لا توجد منتجات محملة!

source: No ratings loaded!
ar: لا توجد تقييمات محملة!

# no_start_with_zero
source: shouldn't start with 0 (zero)
ar: لا ينبغي أن تبدأ ب 0 (صفر)

source: No stores found!
ar: لم يتم العثور على متاجر!

# no_stores_loaded
source: No stores have been loaded!
ar: لم يتم تحميل أي متجر!

source: No Wishlist loaded!
ar: لم يتم تحميل قائمة الرغبات!

# no_wishlist_yet
source: You haven't added anything to your wishlist yet!
ar: لم تقم بإضافة أي شيء إلى قائمة الرغبات الخاصة بك حتى الآن!

source: Ok
ar: حسناً

source: Old Password
ar: كلمة المرور القديمة

source: Old password is not correct.
ar: كلمة المرور القديمة غير صحيحة.

# opps_went_wrong
source: Opps! Something went wrong.
ar: عفوا! هناك خطأ ما.

# order_already_delivered
source: This order has already been delivered.
ar: تم تسليم هذا الطلب بالفعل.

source: Order date
ar: تاريخ الطلب

source: Order is processing...
ar: الطلب قيد المعالجة...

source: Order placed successfully.
ar: تم تقديم الطلب بنجاح.

source: Order shipped
ar: شحن الطلبية

source: Order Total
ar: المبلغ الاجمالي للطلب

source: Orders
ar: الطلبات

source: Out Of Stock
ar: غير متاح

source: paid by VISA
ar: تم الدفع باستخدام بطاقة الفيزا

source: Password
ar: كلمة المرور

# password_is_changed
source: Password has been changed successfully
ar: تم تغيير كلمة المرور بنجاح

# password_no_empty
source: Password field can not be empty
ar: لا يمكن ترك حقل كلمة المرور فارغًا

# password_six_char
source: Password must be at least 6 characters long
ar: الرقم السري يجب الا يقل عن 6 احرف على الاقل

source: Pay At Home
ar: ادفع عند الاستلام

source: Pay Cash At Home
ar: ادفع نقدًا في عند الاستلام

source: Pay via Paypal
ar: ادفع عبر باي بال

source: Pay via visa / Mastercard
ar: الدفع عبر الفيزا / ماستركارد

source: Payment
ar: الدفع

source: Payment status
ar: حالة الدفع

# phone
source: Phone Number
ar: رقم الجوال

# phone_required
source: phone is required
ar: رقم الجوال مطلوب

# pick_address
source: Please pick an address
ar: الرجاء اختيار عنوان

# pick_image
source: Please pick an image
ar: الرجاء اختيار صورة

source: Pick Images
ar: اختر صور

# pick_images_first
source: please pick images first
ar: الرجاء اختيار الصور أولا

# pieces_available
source: pieces available in stock
ar: قطعة متوفرة في المخزون

source: Pincode
ar: الرمز البريدي

# pincode_required
source: pincode is required
ar: الرمز البريدي مطلوب

source: Place Order
ar: تنفيذ الطلب

source: please select category
ar: الرجاء تحديد الفئة

source: Please wait...
ar: الرجاء الإنتظار...

source: preparing
ar: جاري التحضير

source: Price
ar: السعر

source: price required
ar: السعر المطلوب

source: Product added successfully.
ar: تمت إضافة المنتج بنجاح.

source: Product description
ar: وصف المنتج

# product_description_required
source: product description is required
ar: وصف المنتج مطلوب

source: Product name
ar: اسم المنتج

# product_name_required
source: product name is required
ar: اسم المنتج مطلوب

# product_no_reviewed_yet
source: This product has not been reviewed yet!
ar: لم يتم تقييم هذا المنتج بعد!

source: Product updated successfully.
ar: تم تحديث المنتج بنجاح.

source: Profile
ar: الملف الشخصي

source: Province
ar: المحافظة

# province_required
source: province is required
ar: اسم المحافظة مطلوب

source: Quantity
ar: الكمية

source: quantity is required
ar: الكمية مطلوبة

source: Rate this product
ar: قيم هذا المنتج

source: Ratings
ar: تقييمات

source: Reset
ar: إعادة ضبط

source: Review
ar: التقييم

source: Review Added
ar: تم التقيم

source: Reviews
ar: المراجعات

source: Save Address
ar: حفظ العنوان

# save_changes
source: Save The Changes
ar: احفظ التغييرات

source: Search
ar: بحث

# search_for_product
source: Search for the product.
ar: ابحث عن المنتج.

source: select category
ar: اختر الفئة

source: select main category
ar: حدد الفئة الرئيسية

source: select subcategory
ar: حدد فئة فرعية

source: Seller
ar: البائع

# set_default
source: Setting as a default...
ar: تعيين كافتراضي...

source: shipping
ar: تم الشحن

source: Shipping Cost
ar: تكلفة الشحن

source: Shop
ar: تسوق

source: Sign up
ar: اشتراك

source: Similar Items
ar: منتجات مشابهة

source: Sold out
ar: بٍيعَ

source: Statics
ar: الاحصائيات

# store_has_no_items_yet
source: This store has no items yet!
ar: هذا المتجر لا يحتوي على منتجات حتى الآن!

source: Store Logo
ar: شعار المتجر

source: Store Name
ar: اسم المتجر

# store_no_empty
source: Please enter your store name
ar: الرجاء إدخال اسم متجرك

source: Store updated successfully.
ar: تم تحديث المتجر بنجاح.

source: Stores
ar: المتاجر

source: Success
ar: نجاح

source: Suppliers only
ar: الباعة فقط

source: Total
ar: المجموع

source: Total balance
ar: إجمالي الرصيد

source: Total Price
ar: المبلغ الاجمالي

# try_to_reload_app
source: Please try to reload the application!
ar: يرجى محاولة إعادة تحميل التطبيق!

source: Updating...
ar: جارٍ التحديث...

source: Upload
ar: تحميل

source: USD
ar: دولار

# warn_msg_for_store_phone
source: Users can use this number and contact you via WhatsApp. So use your business number.
ar: يمكن للمستخدمين استخدام هذا الرقم والتواصل معاك عبر الواتساب. لذا استخدم رقم عملك.

source: WELCOME
ar: مرحبا

# what_looking_for
source: What are you looking for?
ar: عما تبحث؟

source: Wishlist
ar: المفضلة

source: Write Review
ar: قيم المنتج

source: Yes
ar: نعم

# you_have_new_order
source: You have a new order ðŸ˜ƒ
ar: لديك طلبية جديدة 😃

# your_order_shipped
source: Your order has been shipped ðŸ˜€
ar: لقد تم شحن طلبيتك 😀

# your_review_is_added
source: Thanks! Your review is added.
ar: شكرًا! تمت إضافة رأيك.
